## Data frames

In [2]:
import pandas as pd

In [3]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

print(type(items))

<class 'dict'>

In [4]:
# Os labels são formados pela união dos índices
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [5]:
# Dessa vez sem passar os índices
data = {'Bob' : pd.Series([245, 25, 55]),
        'Alice' : pd.Series([40, 110, 500, 45])}

df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [6]:
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [7]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [8]:
len(shopping_carts.columns)

2

In [9]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [10]:
shopping_carts.shape

(5, 2)

In [11]:
shopping_carts.ndim

2

In [12]:
shopping_carts.size

10

## Subsetting

In [13]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [14]:
alice_shopping_cart = pd.DataFrame(items, columns = ['Bob'])
alice_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [15]:
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [16]:
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

### Adicionando índices

In [17]:
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}
df = pd.DataFrame(data)
df

   Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

In [18]:
# indíces novos
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [19]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

store_items = pd.DataFrame(items2)
store_items

   bikes  glasses  pants  watches
0     20      NaN     30       35
1     15     50.0      5       10

In [20]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [21]:
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [22]:
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

###  Como acessar e alterar linhas e células diretamente

Mais uma vez escolhas de design bem estranhas.

In [23]:
store_items.loc[['store 1']]

         bikes  glasses  pants  watches
store 1     20      NaN     30       35

In [24]:
# a coluna sempre vem antes da linha ao acessar uma célula desse jeito(WTF????)
store_items['bikes']['store 2']

15

In [25]:
# nova coluna
store_items['shirts'] = [15,2]
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

In [26]:
# nova coluna com operação aritmética
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

# IMPORTANTE

### Inserindo novos valores no data frame

In [27]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index = ['store 3'])
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

In [28]:
store_items = store_items.append(new_store)
store_items

c:\python36\lib\site-packages\pandas\core\frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    15.0   45.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

#### Usando valores que já existem no data frame para criar uma nova coluna

In [29]:
store_items['new watches'] = store_items['watches'][1:]
store_items

         bikes  glasses  pants  shirts  suits  watches  new watches
store 1     20      NaN     30    15.0   45.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

In [30]:
# escolhe a posição da nova coluna, o label do índice e os valores
# não permite duplicatas

try:
    store_items.insert(4, 'shoes', [8,5,0])
except ValueError:
    print("Não é possível inserir duplicatas")
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches  new watches
store 1     20      NaN     30    15.0      8   45.0       35          NaN
store 2     15     50.0      5     2.0      5    7.0       10         10.0
store 3     20      4.0     30     NaN      0    NaN       35         35.0

In [31]:
# remove uma coluna inteira

try:
    store_items.pop('new watches')
except KeyError:
    print("A coluna não existe na tabela")
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN      0    NaN       35

In [32]:
# axis = 1 remove colunas, axis = 0 remove linhas (meu deus do céu hahahaha)
try:
    store_items = store_items.drop(['watches', 'shoes'], axis = 1)
except KeyError:
    print("Elementos não encontrados no eixo")
store_items

         bikes  glasses  pants  shirts  suits
store 1     20      NaN     30    15.0   45.0
store 2     15     50.0      5     2.0    7.0
store 3     20      4.0     30     NaN    NaN

In [33]:
try:
    store_items = store_items.drop(['store 1', 'store 2'], axis = 0)
except KeyError:
    print("Elementos não encontrados no eixo")
store_items

         bikes  glasses  pants  shirts  suits
store 3     20      4.0     30     NaN    NaN

### Renomeando colunas e linhas

O rename() aceita como argumento índices ou colunas na forma de um dicionário. A **chave** é o nome antigo e o **valor** é o novo nome.

In [34]:
store_items = store_items.rename(columns = {'bikes': 'hats'})
store_items

         hats  glasses  pants  shirts  suits
store 3    20      4.0     30     NaN    NaN

In [35]:
store_items = store_items.rename(index = {'store 3': 'last store'})
store_items

            hats  glasses  pants  shirts  suits
last store    20      4.0     30     NaN    NaN

### Mudando o indice para uma das colunas existente

Deve existir um bom motivo para fazer isso.

In [36]:
store_items = store_items.set_index('pants')
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN

## Lidando com dados faltantes

In [38]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [44]:
x = store_items.isnull()
x

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1  False     True  False   False  False  False    False
store 2  False    False  False   False  False  False    False
store 3  False    False  False    True  False   True    False

In [47]:
x = store_items.isnull().sum()
x

bikes      0
glasses    1
pants      0
shirts     1
shoes      0
suits      1
watches    0
dtype: int64

In [48]:
x = store_items.isnull().sum().sum()
x

3

In [50]:
store_items.dropna(axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0      5    7.0       10

In [51]:
store_items.dropna(axis=1)

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

### LEMBRETE

Para alterar de fato o dataset, é preciso adicionar o parâmetro ```Inplace = True``` na função ```dropna()``` ou outras que modificam os dados.

### Trocando NaNs por valores

In [54]:
store_items.fillna(0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      0.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     0.0     10    0.0       35

### Métodos para preencher Nans

É possível preencer um valor faltante com o valor anterior da coluna(ou linha). Se não tiver nenhum valor na coluna anterior ao NaN, nada é feito. Também existe o método oposto de pegar o próximo valor da fila.

In [55]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [56]:
# foward fill - coluna
store_items.fillna(method='ffill', axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [58]:
# foward fill - linha
store_items.fillna(method='ffill', axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [59]:
# backward fill - coluna
store_items.fillna(method='backfill', axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [60]:
# backward fill - linha
store_items.fillna(method='backfill', axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     30.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    10.0   10.0   35.0     35.0

## Interpolação

O pandas permite interpolação para preencher os dados faltantes. Preciso estudar mais sobre isso, não dá pra sair usando essas funções assumindo linearidade ou alguma outra propriedade sem entender o dataset primeiro.

In [64]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [68]:
# interpolação linear - colunas
store_items.interpolate(method='linear', axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

Olhar para as linhas do dataset ajuda a entender melhor como é usada uma reta para ligar os pontos.

In [69]:
# interpolação linear - colunas
store_items.interpolate(method='linear', axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0